openfoam2206/tutorials/immersedBoundary/pitzDaily/Turbulent/kEpsilon/pitzDailyTurbulentFe41/Allrun
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application="simpleFoam"

runApplication blockMesh
\cp save/boundary constant/polyMesh/

\rm -rf 0
\cp -r 0_org 0

runApplication potentialFoam
runApplication $application
runApplication writeIbMasks
